[
  {
    "title": "Abstract",
    "content": "Pure TiO 2 and various silver-enriched TiO 2 powders were prepared by the sol-gel process controlled in the reverse micellar environment.The catalysts were tested in CO 2 photocatalytic reduction and characterized by X-ray diffraction (XRD), nitrogen adsorption measurement and UV-vis.Methane and methanol were the main reduction products.The yield of methane and methanol increases when modifying the TiO 2 by silver incorporation is caused by two mechanisms: up to 5% of Ag in TiO 2 the Ag impurity band inside the TiO 2 bandgap decreases the absorption edge and increases so the electron-hole pair generation, above 5% of Ag in TiO 2 Ag metallic clusters are formed in TiO 2 crystals with Shottky barrier at the metal-semiconductor interface, which spatially separates electron and holes and increases their lifetime (decreases probability of their recombination)."
  },
  {
    "title": "Experimental",
    "content": "Pure TiO 2 and various silver-enriched TiO 2 powders were prepared by the sol-gel process controlled in the reverse micellar environment.Pure TiO 2 was synthesized by the addition of Tita- The surface area and porous structure of prepared catalysts were evaluated from nitrogen adsorption isotherms by the BET and BJH methods, respectively.Nitrogen physical adsorption was performed on a volumetric apparatus ASAP2020 Micromeritics (USA).Before analyses the samples were dried at 105 • C for 24 h in vacuum (0.1 Pa). UV-vis diffuse reflectance spectra of samples were recorded using GBS CINTRA 303 spectrometer equipped with a diffuse reflectance attachment with a spectralon-coated integrating sphere against spectralon reference.The reflectances were recalculated to the absorption using the Schuster-Kubelka-Munk equation, where R ∞ is the diffuse reflectance from a semi-infinite layer.Absorption edge was estimated by extrapolating the decreasing portion of the spectrum to the abscissa at zero absorption.Ag-to-TiO 2 mass ratio in Ag/TiO 2 powders were determined by X-ray fluorescence (XRF) analysis using an ARL 9400 XP sequential WD-XRF spectrometer with the standard deviation lower than 5%. The purity (carbon content in weight %) of the powders was specified on an Elementar Vario EL III (Elementar).The detection limit of the apparatus was 0.1 wt.%. XRD powder diffraction patterns were obtained with the aid of a Seifert-FMP or a Panalytical-MPD laboratory diffractometer with Cu K␣ radiation in the conventional focusing Bragg-Brentano geometry in the diffraction angle range 2 = 10-90 • . The photocatalytic reduction of carbon dioxide was carried out in a homemade apparatus (Fig. 1). The photocatalytic reduction of carbon dioxide was carried out in a stirred batch annular reactor with a suspended catalyst illuminated by UV 8 W Hg lamp (254 nm).GC/FID/TCD was used for the analysis of gas and liquid reaction products.The details of the photocatalytic CO 2 reduction experiment and analytical methods were described in our previous publication [39].It is important to minimize the influence of transport phenomena during kinetic measurements.The elimination of CO 2 diffusion from the bulk of gas through the gas-liquid interface in a laboratory batch slurry reactor was accomplished by saturating the liquid with pure CO 2 before the reaction had been started [4,11].Catalyst loading of 1 g dm -3 was chosen to avoid concentration gradients in the bulk of stirred liquid with TiO 2 suspension due to the scattering effect of light caused by the high TiO 2 concentration [11,16,40,41].The determination of suitable volume of the liquid phase in our annular photoreactor to fulfil the requirement of perfect mixing has been published recently as 100 ml [42]. The accuracy of measurements was verified by series of repeated measurements.Average values were mentioned in this article.Maximal relative error was 5%."
  },
  {
    "title": "Results and discussion",
    "content": "The basic textural properties of prepared titania and doped titania samples are summarised in Table 1 together with real Ag content determined by XRF.All samples possess a relatively high surface area; moreover, the positive effect of silver, which increases the surface area by about 15%, is clearly noticeable.It is obvious that the surface areas of Ag-doped TiO 2 samples varied only slightly and they are independent on the growth of Ag amount.The pore maxima of all samples are nearly the same without dependence on the Ag presence. The purity of all prepared samples was excellent, because the organic residual content was lower than 0.1 wt.%. XRD analysis confirmed the presence of the pure anatase crystallite structure for all samples.Ag was not detected in XRD pattern, probably Ag is situated in the bulk (inside the TiO 2 crystals) and/or Ag clusters are smaller than 0.3 nm.Fig. 2 shows the UV-vis spectra of Ag-TiO 2 catalysts.It is seen that (i) the maxima of the UV-vis band increased with the increasing Ag loading from 360 to 367 nm and (ii) the maximum absorption wavelength increased with increasing Ag loading, i.e. the absorption was shifted into the visible region for Ag-TiO 2 catalysts and the shift increased with the increasing amount of silver.The absorption edge (Fig. 2) values are given in Table 1. The effect of irradiation time on the formation of CO 2 photocatalytic reduction products was investigated over a period of 0-24 h on TiO 2 catalysts with different amount of Ag.Fig. 3 shows the evolution of all reaction products as the functions of the irradiation for a 7% Ag-TiO 2 catalyst.Two main products were determined: methane in the gas phase and methanol in the liquid phase.Hydrogen and low amounts of carbon monoxide were also detected.Other products such as formic acid, formaldehyde, ethane and ethylene could also be formed [2,16], but they were undetectable.The observed order of yields (mol/g cat ) order was: We assume on the basic of observed products the mechanism where the formation of carbon monoxide from • CO 2 -radical is the first step.Then both methane and methanol are formed in the parallel reactions.This mechanism was first suggested by Anpo [3]. Several authors [2,5,17] proposed the same mechanism with the exception that they predicted the formation of a carbon radical instead of surficial carbon. Comparisons of CH 4 , CH 3 OH, H 2 and CO yields over TiO 2 with different Ag content are shown in Figs.4-6A and B respectively.The yields of methane were negligible during the first 8 h of irradiation in all cases with the exception of catalyst 1 and 5% Ag-TiO 2 (Fig. 4).A similar trend of yield-time dependency was observed; only the shape for the sample with 7% Ag-TiO 2 was slightly different.A substantial increase of methane yield was observed after 8 h of irradiation.The highest yield of methane was observed for the 7% Ag-TiO 2 catalyst.The yields of methanol were one order of magnitude lower than the yields of methane (Fig. 5).Data at 5 h were measured but were under the limit of determinableness (12 g/l i.e. 0.38 mol/gcatalyst).The steepest curve of methanol yield was measured for the 7% Ag-TiO 2 catalyst. The hydrogen yields were small during the first 13 h of irradiation in all cases (Fig. 6A).After 15 h the hydrogen yields started increasing slowly.The yields of carbon monoxide increased slowly during the reaction but all yields were near the limit of detection (Fig. 6B). The data from the longest reaction time span were chosen for the comparison because the yields of all products were the highest and the most accurate.The effect of silver doping on the yields  of the two main products (methane and methanol) related to the weight of the catalyst is depicted in Fig. 7.The photoreactivity of Ag-TiO 2 increases with the increase in the Ag dopant concentration.Both yields are the highest for 7% Ag-TiO 2 .The effect of the Ag dopant on the CO 2 photocatalytic reduction has not been studied yet.However, an optimum amount of Ag corresponding to the highest product yields was found for other photocatalytic reactions [27,28,34,36]. The yields of the two main products (methane and methanol) expressed per 1 m 2 of catalyst surface (Fig. 8) show similar trends with the highest yields obtained for 7% Ag-TiO 2 .This indicates that the specific surface area is not the most decisive parameter in the CO 2 photocatalytic reduction. Doping with metals or metal oxides could cause two effects: (1) Firstly, it creates impurity band inside the TiO 2 bandgap, thus shifting the absorption edge to the visible region [29].The decrease of the absorption edge and the shift of absorption wavelength into the visible region in this paper are clearly visible from Table 1 and Fig. 2, for Ag content up to 5%.The decrease of the absorption edge increases the electron and hole pair photogeneration, which causes yields increase of CO 2 photoreduction.(2) Secondly, for Ag content above 5% silver atoms are not anymore randomly located in TiO 2 crystal, but forms probably metallic clusters inside TiO 2 crystal.These metal clusters could provoke a decrease in the electron-hole recombination rate [43,44].This hypothesis was based on the fact that the Fermi level of TiO 2 is higher than that of silver metals [45].Such phenomenon would be expected to lead to the formation of a Schottky barrier at metal-semiconductor contact region, which causes the charge separation, the decrease of electron-hole recombination rate and consequently increase of the TiO 2 photocatalytic activity.The above mentioned fact could be the reason for observed yields increases with increased Ag content in our experiments with CO 2 photocatalytic reduction and is the main reason of yields increase with 7% Ag-TiO 2 since the absorption edge has same value as 5% Ag-TiO 2 . Our results are in agreement with other works dealing with photocatalytic activity of Ag-doped TiO 2 .For example, the presence of Ag in TiO 2 increased the yield of dye degradation [27,28,31,32], photooxidation of 2-propanol [29], degradation Fig. 8. Dependence of the product yields related to specific surface area (after 24 h of irradiation) on the different catalysts. of 1,4-dichlorobenzene [33] and degradation of oxalic acid [37]."
  }
]